Jeeves - финансовый помощник с интегрированным искусственным интеллектом. Взаимодействие с пользователями производится по средствам TG бота.




Для работы проекта, необходимо:


1. Установить Python v3.10 или больше.
2. Склонить с гита проект.
 git clone https://gitlab.com/AttractorSchool/esdp-ap-11-team-3.git
3. Поднимите виртуальное окружение.
4. Установить все необходимые для работы библиотеки из файла reqs.txt  
pip install -r reqs.txt
5. Поднять PostgreSQL и Redis.
6. Создать своего ТГ бота и получить его токен. 
7. Получить API токен чата GPT для работы с LLM GPT, либо выбрать любую другую возможную LLM, которые доступны в LangChain на текущий момент.
8. Создать в корне приложения файл .env 
9. В этом файле необходимо прописать ваши ключи в следующем формате:
TELEGRAM_TOKEN=тут ваш токен
OPENAI_API_KEY=API-ключ от чата GPT
DATABASE_URL='адрес PostgreSQL:порт'


10. Далее вам необходимо запустить приложение:
* Запустить файл app.py (для работы основного приложения)
* Запустить файл report_fastapi.py (для работы отчетов через браузер)
11. Вам необходимо написать неформализованное сообщение о финансовой транзакции в ТГ бот, токен которого вы подключили. Например купил что-то за такую-то сумму.